# Напишите программу, которая проверяет, делится ли введенное
# Пользователем число на 3.

print("Да" if int(input("Введите число: ")) % 3 == 0 else "Нет")