# Напишите программу, которая проверяет, попадает ли введение
# пользователем число в диапазон от 5 до 10 включительно.

print("Да" if 5 <= int(input("Введите число: ")) <= 10 else "Нет")
