# Напишите программу, которая проверяет, сколько тысяч во введенном
# пользователем числе (определяется четвертая цифра справа в десятичном представлении числа).

print(int(input("Введите число: ")) // 1000)
